% Old ptau (pressure * vibrational relaxation time) plot for O2-O
% original 22.05.2020
% 15.09.2025 by Maksim Melnik

addpath('../src/')
load("../data/particles.mat", "O2", "O")

% данные из каппы
gg=[
1	0	300		3.20193e-23	2.87047e-18	3.5954e-18	3.91896e-18	9.94356e-18	
1	0	400		1.33909e-22	3.43365e-18	3.97556e-18	4.0301e-18	1.49798e-17	
1	0	500		4.05261e-22	3.97192e-18	4.3234e-18	4.13799e-18	2.00568e-17	
1	0	600		1.01689e-21	4.49768e-18	4.6521e-18	4.23985e-18	2.50641e-17	
1	0	700		2.19764e-21	5.01825e-18	4.96899e-18	4.33553e-18	2.99517e-17	
1	0	800		4.24741e-21	5.53839e-18	5.2786e-18	4.42549e-18	3.46979e-17	
1	0	900		7.53162e-21	6.06139e-18	5.58394e-18	4.51033e-18	3.9295e-17	
1	0	1000	1.24761e-20	6.58964e-18	5.8871e-18	4.59063e-18	4.37429e-17	
1	0	1500	8.04131e-20	9.36179e-18	7.41243e-18	4.93934e-18	6.39172e-17	
1	0	2000	2.77125e-19	1.24292e-17	9.00977e-18	5.22655e-18	8.12254e-17	
1	0	2500	6.87256e-19	1.58487e-17	1.07144e-17	5.4734e-18	9.63427e-17	
1	0	3000	1.39548e-18	1.96496e-17	1.25405e-17	5.69149e-18	1.09755e-16	
1	0	3500	2.48058e-18	2.38473e-17	1.44934e-17	5.88791e-18	1.21806e-16	
1	0	4000	4.01289e-18	2.84491e-17	1.65741e-17	6.06731e-18	1.32747e-16	
1	0	4500	6.05371e-18	3.34559e-17	1.87805e-17	6.23294e-18	1.42766e-16	
1	0	5000	8.65554e-18	3.88644e-17	2.1109e-17	6.38715e-18	1.52006e-16	
1	0	5500	1.18627e-17	4.46678e-17	2.35549e-17	6.53172e-18	1.60578e-16	
1	0	6000	1.57123e-17	5.08564e-17	2.61125e-17	6.66802e-18	1.68573e-16	
1	0	6500	2.02349e-17	5.74182e-17	2.87756e-17	6.79712e-18	1.76061e-16	
1	0	7000	2.54555e-17	6.43395e-17	3.15377e-17	6.91991e-18	1.83104e-16	
1	0	7500	3.1394e-17	7.16051e-17	3.4392e-17	7.0371e-18	1.89751e-16	
1	0	8000	3.80663e-17	7.9199e-17	3.73316e-17	7.14929e-18	1.96042e-16	
1	0	8500	4.54845e-17	8.71041e-17	4.03496e-17	7.25696e-18	2.02014e-16	
1	0	9000	5.36575e-17	9.5303e-17	4.34392e-17	7.36056e-18	2.07697e-16	
1	0	9500	6.25914e-17	1.03778e-16	4.65937e-17	7.46044e-18	2.13117e-16	
1	0	10000	7.22901e-17	1.1251e-16	4.98063e-17	7.55691e-18	2.18296e-16	
1	0	11000	9.39877e-17	1.30678e-16	5.63807e-17	7.74071e-18	2.28012e-16	
1	0	12000	1.18745e-16	1.49662e-16	6.31135e-17	7.91378e-18	2.36976e-16	
1	0	13000	1.46538e-16	1.69326e-16	6.99597e-17	8.07755e-18	2.45294e-16	
1	0	14000	1.77325e-16	1.8954e-16	7.68779e-17	8.23317e-18	2.53051e-16	
1	0	15000	2.11056e-16	2.1018e-16	8.38312e-17	8.38159e-18	2.60314e-16	
1	0	16000	2.47671e-16	2.31133e-16	9.07863e-17	8.52357e-18	2.67142e-16	
1	0	17000	2.87106e-16	2.52294e-16	9.77138e-17	8.65977e-18	2.73581e-16	
1	0	18000	3.29295e-16	2.7357e-16	1.04588e-16	8.79073e-18	2.79672e-16	
1	0	19000	3.74167e-16	2.94873e-16	1.11387e-16	8.91694e-18	2.85449e-16	
1	0	20000	4.21652e-16	3.16127e-16	1.1809e-16	9.0388e-18	2.90941e-16	
];

ptau_Torres = [
% # --O2-O:Minnesota PES# -------combined-----# T p*tau_rot p*tau_vib
% # [K] [atm*s] [atm*s]
2000 2.16e-09 2.62e-08
3000 3.02e-09 2.32e-08
4000 3.80e-09 2.19e-08
5000 4.49e-09 2.22e-08
6000 5.41e-09 2.19e-08
8000 6.90e-09 2.19e-08
10000 8.12e-09 2.19e-08
12000 9.42e-09 2.21e-08
15000 1.09e-08 2.15e-08
20000 1.20e-08 2.06e-08
30000 1.39e-08 2.00e-08
40000 1.57e-08 2.03e-08
50000 1.79e-08 2.08e-08
60000 1.99e-08 2.25e-08
80000 2.51e-08 2.45e-08
100000 3.01e-08 2.68e-08    
];

shatalov=[
    0.040679	4.446e-08
0.04735	4.048e-08
0.057686	4.371e-08
0.068977	5.921e-08
0.0792	9.153e-08];
Tshatalov=(2000:500:15000)';
shatalov=[Tshatalov.^(-1/3) ...
    1.5e-12*Tshatalov.^0.5./(1-exp(-2238./Tshatalov))...
    .*exp(86.4*Tshatalov.^(-1/3))];

breen=[
    0.066785	2.9984e-08
0.075672	3.1762e-08
0.099927	2.9525e-08];
Tbreen=(1000:200:3400)';
breen=[Tbreen.^(-1/3) Tbreen./Tbreen*3e-8];
kalogerakis=[
    0.146734	1.3918e-08];

kiefer=[
    0.063121	1.2419e-08
0.069307	2.0487e-08
0.076418	2.6324e-08
0.087304	3.2264e-08];
Tkiefer=(1500:200:3300)';
kiefer=[Tkiefer.^(-1/3) 4.35e-8-7.75e-12*Tkiefer];

ptau_Grover = [%x  ptau_Grover
2975.4  2.0018e-08
4973.2  2.0463e-08
5986.5  2.1335e-08
7998.6  2.2489e-08
9996.5  2.2756e-08
11994.3  2.3026e-08
15019.8  2.6362e-08
];

h = 6.6261*10^(-34);
k = 1.3807e-23;
c = 2.99*10^10;
we=1580.19;
nu=c*we;
theta=h*nu/k;
T=gg(:,3);

M1 = O2;
M2 = O;
kvt10_ssh = zeros(length(T), 1);
kvt10_fho = zeros(length(T), 1);
kvt10_Billing = zeros(length(T), 1);
kvt10_Esposito = zeros(length(T), 1);
for i_T = 1:length(T)
    kvt_temp = kvt_ssh(T(i_T), M1, M2, 1, 1);
    kvt10_ssh(i_T) = kvt_temp(1);
    kvt_temp = kvt_fho_old(T(i_T), M1, M2, 1);
    kvt10_fho(i_T) = kvt_temp(1);
    kvt_temp = kvt_billing(T(i_T), M1, M2, 1, 1);
    kvt10_Billing(i_T) = kvt_temp(1);
    kvt_temp = kvt_Esposito(T(i_T));
    kvt10_Esposito(i_T) = kvt_temp(1);
end
ptau_SSH = 1.363e-22 * T ./ (kvt10_ssh * 1e6 .* (1 - exp(- theta ./ T)));
ptau_FHO = 1.363e-22 * T ./ (kvt10_fho * 1e6 .* (1 - exp(- theta ./ T)));
ptau_Billing = 1.363e-22 * T ./ (kvt10_Billing * 1e6 ...
                                            .* (1 - exp(- theta ./ T)));
ptau_Esposito = 1.363e-22 * T ./ (kvt10_Esposito  ...
                                            .* (1 - exp(- theta ./ T)));


mu=1/(1/32+1/16);
mw=10.^(5e-4*mu^0.5*theta^(4/3).*(T.^(-1/3)-0.015*mu^0.25)-8);

k10FHO=gg(:,5)*1e6;
ptFHO=1.363e-22*T./(k10FHO.*(1-exp(-theta./T)));


figure('Units', 'normalized', 'OuterPosition', [0 0 0.6 0.7]);
semilogy(T.^(-1/3), ptau_Billing, ':','Color', [255,193,7]/255, ...
                                                        'LineWidth', 2)
hold on;
semilogy(T.^(-1/3),ptFHO,'-.','Color', [0 0 0],'LineWidth', 1.5)
semilogy(T.^(-1/3), ptau_FHO, ':','Color', [0 30 0]/255,'LineWidth', 1.5)
semilogy(T.^(-1/3), ptau_SSH, ':','Color', [76,175,80]/255,  ...
    'LineWidth', 3)
semilogy(T.^(-1/3), ptau_Esposito, 'Color', [0,188,212]/255, ...
                                                        'LineWidth', 2)
semilogy(kiefer(:,1),kiefer(:,2),'o','LineWidth', 1.8, ...
    'color', [33,150,243]/255, 'markerfacecolor',[3,169,244]/255)
semilogy(breen(:,1),breen(:,2),'x','Color', [0.7 0 0.1],'LineWidth', 2,...
    'markersize', 8)
semilogy(kalogerakis(1),kalogerakis(2),'^','LineWidth', 1.5,...
    'color', [211,84,0]/255,'markerfacecolor', [230,126,34]/255,...
    'markersize', 9)
semilogy(shatalov(:,1),shatalov(:,2),'*','Color', [63,81,181]/255,...
    'LineWidth', 1, 'markersize', 7)
semilogy(T.^(-1/3), mw, 'LineWidth', 1, 'color', [156,39,176]/255)
semilogy(ptau_Torres(:, 1).^(-1/3), ptau_Torres(:, 3), ...
                            'Color', [239, 71, 111]/255, 'linewidth', 2)
semilogy(ptau_Grover(:, 1).^(-1/3), ptau_Grover(:, 2), ...
                    'sq', 'Color', [17, 138, 178]/255, 'linewidth', 2)
legend('Billing', 'FHO RS', 'FHO 2', 'SSH', 'Esposito', ...
    'Kiefer & Lutz, 1967','Breen\it et. al.\rm, 1973',...
    'Kalogerakis\it et. al.\rm, 2005',...
    'Ibraguimova\it et. al.\rm, 2013', 'Millikan-White', 'Torres', ...
    'Grover, 2019', 'Location', 'east')
% ylim([1e-9 2e-3])
% xlim([0.035 0.153])
% xlim([0.03 0.15])
ylabel('\it{}p\rm\tau, \rmатм \cdot c');
xlabel('\it{}T\rm ^{-1/3}, K');
grid on;
set(gca, 'FontSize', 12, 'FontName', 'Times New Roman');

% set(gcf, 'color', 'none');
%  set(gca, 'color', 'none');

rmpath('../src/')